# Parameters
nc: 6  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [8,10, 13,24, 33,18]  # P3/8
  - [24,49, 50,36, 47,95]  # P4/16
  - [93,72, 125,158, 298,261]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, unireplknet_t, []], # 4
   [-1, 1, SPPF, [1024, 5]],  # 5
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 6
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 7
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4 8
   [-1, 3, C3, [512, False]],  # 9

   [-1, 1, Conv, [256, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3 12
   [-1, 3, C3, [256, False]],  # 13 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # 14
   [[-1, 10], 1, Concat, [1]],  # cat head P4 15
   [-1, 3, C3, [512, False]],  # 16 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 1]], # 17
   [6, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-2, -1], 1, Concat, [1]],  # cat head P5 18
   [-1, 3, C3, [512, False]],  # 19 (P5/32-large)

   [[13, 16, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]